[
  {
    "date":"2020-03-20 10:28",
    "entry":"I'm doing great. This is not that different than my normal life. I don't ever leave the house anyway. It's a little louder than normal with the kids home. They just play video games all day, which they love. I'm mildly stressed about trying to keep them on track with their schoolwork, but we'll manage it I think. I'm completely optimistic and looking forward to the future where:<ul><li>We realize that working from home is totally possible, and in many cases more convenient than driving into an office.</li><li>Maybe traffic will, for once, get better instead of worse?</li><li>Maybe we'll convert unused office space into house for the homeless?</li><li>We will start paying attention to our nasty-ass behavior and stop shaking hands.</li><li>Maybe all doors can be auto-opening?</li><li>Maybe we can all switch to QR-code authentication instead of typing PINs on nasty ATMs and debit card machines.</li><li>Maybe some folks will actually learn something about hygiene.</li><li>We might understand why decentralization is so important when Google, Netflix, Amazon, and other services break because they can't handle the traffic of us all \"working\" from home. Maybe these huge companies will start implementing more peer to peer protocols, which would make everything way faster, increase privacy, reduce tracking, etc.</li><li>Maybe we'll start respecting and paying our workers more. Perhaps we'll realize that life doesn't stop when the developers stop coding or when the C-levels stop being parasites (or whatever it is that they do). Maybe we'll start paying farmers, teachers, grocers, chefs, delivery people, etc. a little better?</li><li>Maybe universal basic income will make more sense to the general public and we'll actually get it.</li><li>Maybe Medicare for All will finally make sense to everyone.</li><li>Maybe paid sick leave will start making sense? Maybe people won't keep coming to work sick and spreading disease.</li><li>Maybe copyright and patent law will stop being so toxic and we'll ensure that life-saving devices, processes, and information are all free to to world instead being exploited for financial gain.</li><li>Maybe the US can learn to be an equal partner with the other countries instead of being arrogant bastards. Maybe the world will stop using the US dollar to base everything on.</li><li>Maybe capitalism can just go die. It's idiotic. We shouldn't measure success on unemployment numbers (\"freedom is minimal - wage slavery is at an all-time high!\"), or on GDP (\"our %0.1 makes this number look good even though most people are poor as hell!\").</li></ul><p>Anyway, yeah, esoteric hopes and dreams. Regular day-to-day isn't that different for me personally, and I'm more of a homebody than I used to be. Looking forward to having captive friends to help me experiment on various video-chat/remote-socializing experiments, hehe."
  },
  {
    "date": "2018-02-11",
    "entry": "What's been going on lately? Hmm. Little bit of work stress because I'm a goddamn idealist and I don't want to just do work, I want to do excellent work. Problem is, I look back at my own \"excellent\" work a few months later and it's crap too. Ever evolving. Ever changing. I think it's a good thing, because it's just how I am... On a more positive note, I had a pretty pleasant weekend. We had a little dinner party with Leah, Katie, and the Otisi. Andrea set up a folding table in our tiny office with her hostpital blanket as the tablecloth, a scarf as the runner, and some little plants and electronic tea lights, haha. It was cozy. She made some delicious chicken tinga tacos. Otisi made their fantastic guacamole. Leah and Katie brought some Italian butter-cream frosted cupcakes. Too many details. Random but no-less-important other notes... I've been going to the gym pretty consistently about twice a week - don't feel stronger yet - still can't do a pull-up. Corbin and I are learning to be synthesists using his Arturia KeyStep and the free VCV Rack software. Rhys is getting bigger and wilder, but he's still sweet. Kind of annoyed that he's had a regression in potty training lately though - lots of pee-pants. Andrea is taking pretty good care of herself and she seems generally content - although she has to vent to me about her work every day. And finally, I'm working on getting this website back online. I'm always trying to organize my data - I hope that I finish before I die. If not, someone's gonna have a hell of a time with all the fragments of thoughts and files and random junk on my little server... If that's the case, and you're reading this now - sorry. Not too sorry - more important to live a life than to document every moment of it."
  },
  {
    "date": "2017-09-16",
    "entry": "I had a delightful and very filling breakfast at Elmer's with the family this morning. The smoke from the forest fires was really thick. Despite that, I worked on the boys' club house most of the day. I'm trying to figure out the angles for a really odd roof shape, but I'm unwilling to sit down and actually do the math. We'll see how this turns out... I spent the evening reading GitLab's Docker implementation, reading about Docker Swarm, and messing with CSS3 animations. Random thought: I don't know if I've mentioned this before, but whenever I turn on the air conditioner in the car, Rhys says, \"I love that smell, Dada.\" He really loves the smell of a hot, dusty 12 year old car AC system. Also, I'm trying to teach him to wipe his butt. When he's done wiping it, I give it a couple of wipes, and he always says, \"I love you, Dada\" while I'm wiping him. And we have some kind of rat or mini-beaver living behind our dishwasher, chewing up our cabinetry. This is my life."
  },
  {
    "date": "2017-09-04",
    "entry": "I started trying to teach myself JavaScript, but only got as far as drawing a canvas that resizes with the window. I spent a lot of time trying to figure out how to buy Bitcoin or Ether without having to create an account somewhere or pay any fees or pay more than the market rate - didn't figure that one out yet. Since Columbus Gorge is burning and the city is enveloped in smoke, we took the kids to the Clackamas Town Center mall. Nothing exciting happened there. Corbin attempted to play Super Mario Bros. today with some amount of perseverance, which is good. We all watched a lot of Adventure Time and went a little stir crazy from being inside all day. After we put the kids to bed, Andrea and I played Playerunknown's Battlegrounds with Nick and Jay. It's kind of dull - you just run around this huge map collecting crappy guns. It's not so much a first person shooter as it is a first person scavenging game... Oh well, it's Early Release. Maybe the final version will be more interesting."
  },
  {
    "date": "2017-09-03",
    "entry": "I knocked the cranks off of the kids' bikes today. I really want them to learn to ride. It was really too hot to do anything today, but Corbin still gave it a try and he's already getting much better at balancing. I think taking off the cranks was what he needed."
  },
  {
    "date": "2017-09-02",
    "entry": "Corbin finally learned how to climb a tree... or was brave enough to. Not sure what was stopping him before. He got to the first branch and was going to stop and I encouraged him to go higher. Now he goes to the top of the tree every time. It's not a tall tree, but it probably seems tall."
  }
]
